benchmark/go-frameworks/results/20260924-102750/results/get/echo/r3/40000.txt
Running 40s test @ http://10.128.0.4:8084/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.982ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.982ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.985ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.988ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.068ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.981ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.983ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.982ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.977ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.984ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.980ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.978ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.984ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.992ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.989ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.984ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  515.82us  11.99ms   72.97%
    Req/Sec     2.61k   277.35     4.11k    78.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.29ms
 90.000%    1.56ms
 99.000%    2.56ms
 99.900%    4.67ms
 99.990%    8.30ms
 99.999%   10.48ms
100.000%   12.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.092     0.000000            1         1.00
       0.386     0.100000       119705         1.11
       0.556     0.200000       239474         1.25
       0.701     0.300000       358079         1.43
       0.838     0.400000       478307         1.67
       0.967     0.500000       597164         2.00
       1.030     0.550000       656583         2.22
       1.093     0.600000       716175         2.50
       1.157     0.650000       776142         2.86
       1.222     0.700000       836018         3.33
       1.289     0.750000       895828         4.00
       1.323     0.775000       925622         4.44
       1.358     0.800000       955335         5.00
       1.397     0.825000       985376         5.71
       1.442     0.850000      1015083         6.67
       1.496     0.875000      1044593         8.00
       1.528     0.887500      1059570         8.89
       1.563     0.900000      1074291        10.00
       1.603     0.912500      1089292        11.43
       1.647     0.925000      1104234        13.33
       1.699     0.937500      1119144        16.00
       1.728     0.943750      1126435        17.78
       1.761     0.950000      1133892        20.00
       1.799     0.956250      1141398        22.86
       1.843     0.962500      1148864        26.67
       1.897     0.968750      1156354        32.00
       1.929     0.971875      1160057        35.56
       1.969     0.975000      1163748        40.00
       2.019     0.978125      1167451        45.71
       2.089     0.981250      1171213        53.33
       2.199     0.984375      1174922        64.00
       2.279     0.985938      1176777        71.11
       2.377     0.987500      1178633        80.00
       2.487     0.989062      1180504        91.43
       2.617     0.990625      1182365       106.67
       2.767     0.992188      1184221       128.00
       2.853     0.992969      1185158       142.22
       2.947     0.993750      1186092       160.00
       3.061     0.994531      1187017       182.86
       3.183     0.995313      1187952       213.33
       3.335     0.996094      1188878       256.00
       3.423     0.996484      1189345       284.44
       3.527     0.996875      1189808       320.00
       3.645     0.997266      1190275       365.71
       3.787     0.997656      1190741       426.67
       3.971     0.998047      1191208       512.00
       4.073     0.998242      1191439       568.89
       4.191     0.998437      1191676       640.00
       4.319     0.998633      1191911       731.43
       4.487     0.998828      1192140       853.33
       4.687     0.999023      1192374      1024.00
       4.807     0.999121      1192490      1137.78
       4.943     0.999219      1192605      1280.00
       5.115     0.999316      1192727      1462.86
       5.307     0.999414      1192839      1706.67
       5.571     0.999512      1192958      2048.00
       5.735     0.999561      1193013      2275.56
       5.867     0.999609      1193072      2560.00
       6.047     0.999658      1193130      2925.71
       6.255     0.999707      1193188      3413.33
       6.559     0.999756      1193246      4096.00
       6.755     0.999780      1193276      4551.11
       6.955     0.999805      1193304      5120.00
       7.243     0.999829      1193334      5851.43
       7.631     0.999854      1193363      6826.67
       8.023     0.999878      1193393      8192.00
       8.199     0.999890      1193406      9102.22
       8.327     0.999902      1193421     10240.00
       8.455     0.999915      1193436     11702.86
       8.623     0.999927      1193450     13653.33
       8.895     0.999939      1193465     16384.00
       9.071     0.999945      1193472     18204.44
       9.191     0.999951      1193479     20480.00
       9.495     0.999957      1193487     23405.71
       9.831     0.999963      1193494     27306.67
       9.927     0.999969      1193501     32768.00
      10.055     0.999973      1193505     36408.89
      10.127     0.999976      1193508     40960.00
      10.247     0.999979      1193513     46811.43
      10.287     0.999982      1193516     54613.33
      10.351     0.999985      1193519     65536.00
      10.375     0.999986      1193522     72817.78
      10.455     0.999988      1193523     81920.00
      10.479     0.999989      1193525     93622.86
      10.567     0.999991      1193527    109226.67
      10.607     0.999992      1193528    131072.00
      10.631     0.999993      1193529    145635.56
      10.671     0.999994      1193530    163840.00
      10.767     0.999995      1193531    187245.71
      11.111     0.999995      1193532    218453.33
      11.431     0.999996      1193533    262144.00
      11.431     0.999997      1193533    291271.11
      11.479     0.999997      1193534    327680.00
      11.479     0.999997      1193534    374491.43
      11.655     0.999998      1193535    436906.67
      11.655     0.999998      1193535    524288.00
      11.655     0.999998      1193535    582542.22
      11.743     0.999998      1193536    655360.00
      11.743     0.999999      1193536    748982.86
      11.743     0.999999      1193536    873813.33
      11.743     0.999999      1193536   1048576.00
      11.743     0.999999      1193536   1165084.44
      11.999     0.999999      1193537   1310720.00
      11.999     1.000000      1193537          inf
#[Mean    =        0.994, StdDeviation   =        0.516]
#[Max     =       11.992, Total count    =      1193537]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1594703 requests in 40.00s, 577.91MB read
Requests/sec:  39869.27
Transfer/sec:     14.45MB